#1.Задание
# name = "Привет как дела ?"
# print(name)
# name2 = 'Привет как дела ?'
# print(name2)
# name3 = """Привет как дела ?"""
# print(name3)
#2.Задание
# anime = "one_pece :"
# anime_2 = anime * 2
# print(anime_2)
#3.Задание
# text = "17.2009 :"
# print(text)
# text2 = 17.2009
# print(str(text2))
# Можно с помащю ковычек и с помщю (str)
#4.Задание

#5.Задание
# text = "Advertising companies say advertising is necessary and important. It informs people about new products. Advertising hoardings in the street make our environment colourful. And adverts on TV are often funny. Sometimes they are mini-dramas and we wait for the next programme in the mini-drama. Advertising can educate, too. Adverts tell us about new, healthy products. And adverts in magazines give us ideas for how to look prettier, be fashionable and be successful. Without advertising, life is boring and colourless.But some consumers argue that advertising is a bad thing. They say that advertising is bad for children. Adverts make children ‘pester’ their parents buy things for them. Advertisers know we love our children and want to give them everything. So they use children’s ‘pester power’ to sell their products. Finally, consumers say, if there is advertising there must be rules. Some adverts advertise unhealthy things like cigarettes and make people waste their money."
# print(text.count('s'))
# print(text.count('t'))
#6.Задание
# name = "Nurdan"
# print(name[1:4])
#7.Задание
# text = "Aidana"
# text2 = "Adilet"
# print(text[0]+text2[0]+text[1]+text2[1]+text[2]+text2[2]+text[3]+text2[3]+text[4]+text2[4]+text[5]+text2[5])
#8.Задание
# password = input("Введите пароль: ")
# if password == "2009":
#     print("Password is correct. You are welcome")
# else:
#     print("Password is incorrect. Please, try again")
#9.Задание
# number =int(input("Введите первое число: "))
# if number <= -30:
#     print(f"{number} Там так холодно, лучше дома сиди " )
# elif -30 < number <= 0 :
#     print(f"{number} Холодновато. Оденься потеплее ")
# elif 0 < number <= 15  :
#     print(f"{number} Прохладно. Куртку накинь ")
# elif 15 < number <= 30 :
#     print(f"{number}  Иди погуляй в парке")
# elif 30 < number <= 50 :
#     print(f"{number}  “Ого, как жарко  ")
# elif number > 50  :
#     print(f"{number} Cлишко  жарко")
# else:
#     print("Ошибка")
#10.Задание
# Hour = int(input("Напиши время: "))
# if 0 < Hour <= 6:
#     print("Ночь")
# elif 6 < Hour <= 12:
#     print("Утро")
# elif  12 < Hour <= 18:
#     print("День")
# elif 18 < Hour <= 23:
#     print("Ночь")
# else:
#     print("Error")
#ДОП ЗАДАЧА:
# ball = int(input("Введите свой бал: "))
# if  ball >= 90:
#     print("Отлино")
# elif 80 < ball <= 90:
#     print("Хорошо")
# elif 70 < ball <= 80:
#     print("Удовлетворительно")
# elif 60 < ball <= 70:
#     print("Неудовлетворительно")
# elif ball <= 59:
#     print("Студент должен пересдать экзамен")
# else:
#     print(Error)

# segment1 = int(input("Введите сторону a:"))
# segment2 = int(input("Введите сторону b:"))
# segment3 = int(input("Введите сторону c:"))
# if segment1 + segment2 <= segment3 or segment1 + segment3 <= segment2 or segment2 + segment3 <= segment1:
#      print ("Треугольник нельзя построить")
# elif segment1 != segment2 and segment1 != segment3 and  segment2 != segment3:
#      print ("Разносторонний треугольник")
# elif segment1 == segment2 == segment3:
#      print ("Равносторонний треугольник")
# else:
#     print("Равнобедренный треугольник")


    


