#1.Заднаие
# name = ['Бишкек', 'Ош', 'Нарын', 'Баткен', 'Ыссык-куль', 'Талас', "Mersedes", "BMW", "Kia", "Tayota", "Supra", "Nissan", "Huandai", "Tiko", "Matiz"]
# print(name[2:7])
#2.Задание
# name = [1,2,3,4,5]
# name.reverse()
# print(name)
#3.Задание
# result = []
# a = [1, 3, 4, 5] 
# b = [4, 5, 6, 7]
# a.pop(2)
# a.pop(2)
# print(a)
# print(b)
#4.Задание
# name = [1,2,3,4,5]
# looking_for = min(name)
# print(looking_for)
#5.Задания
# name = [1,2,3,4,5]
# name.clear()
# print(name)
#6.Задания
# name = [1,2,3,4,5]
# print (sum(name))
#7.Задания
# name = [1,2,3,4,5]
# average = sum(name) / len(name)
# print(average)
#8.Задания
# musik = ["Вредина", "Расстояние", "Статус души", "Очи", "За любовь", "Эталон красоты", "Бедный поэт", " Привет", "Не лей"]
# musik[4],musik[8] = musik[8],musik[4]
# print(musik)
#9.Задание.
# numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215,216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 110]
# print(numbers.count(110))
#10.Задания
# password = input("Введите пароль: ")
# if password == "2009":
#     print("Password is correct. You are welcome")
# else:
#     print("Password is incorrect. Please, try again")
# #11.Задание
# number =int(input("Введите первое число: "))
# if number <= -30:
#     print(f"{number} Там так холодно, лучше дома сиди " )
# elif -30 < number <= 0 :
#     print(f"{number} Холодновато. Оденься потеплее ")
# elif 0 < number <= 15  :
#     print(f"{number} Прохладно. Куртку накинь ")
# elif 15 < number <= 30 :
#     print(f"{number}  Иди погуляй в парке")
# elif 30 < number <= 50 :
#     print(f"{number}  “Ого, как жарко  ")
# elif number > 50  :
#     print(f"{number} Cлишко  жарко")
# else:
#     print("Ошибка")
# #12.Задание
# Hour = int(input("Напиши время: "))
# if 0 < Hour <= 6:
#     print("Ночь")
# elif 6 < Hour <= 12:
#     print("Утро")
# elif  12 < Hour <= 18:
#     print("День")
# elif 18 < Hour <= 23:
#     print("Ночь")
# else:
#     print("Error")
# #ДОП ЗАДАЧА:
# ball = int(input("Введите свой бал: "))
# if  ball >= 90:
#     print("Отлино")
# elif 80 < ball <= 90:
#     print("Хорошо")
# elif 70 < ball <= 80:
#     print("Удовлетворительно")
# elif 60 < ball <= 70:
#     print("Неудовлетворительно")
# elif ball <= 59:
#     print("Студент должен пересдать экзамен")
# else:
#     print(Error)

# segment1 = int(input("Введите сторону a:"))
# segment2 = int(input("Введите сторону b:"))
# segment3 = int(input("Введите сторону c:"))
# if segment1 + segment2 <= segment3 or segment1 + segment3 <= segment2 or segment2 + segment3 <= segment1:
#      print ("Треугольник нельзя построить")
# elif segment1 != segment2 and segment1 != segment3 and  segment2 != segment3:
#      print ("Разносторонний треугольник")
# elif segment1 == segment2 == segment3:
#      print ("Равносторонний треугольник")
# else:
#     print("Равнобедренный треугольник")



