# 1 Задание
# for name in range(1,6):
#    print(f"{name}) {0*5}")
# 2 Звдание
# numbers = []
# print(numbers)
# for num in range(1,101):
#     numbers.append(num)
# print(numbers)
# 4 Задание
# numbers = []
# print(numbers)
# for num in range(1,498):
#     if num %2 == 0:
        # print("Число чётное")
#     else:
#         print("Нечётное число")
# 5 Задание
# number = []
# print(number)
# for num in range(1,1001):
#     number.append(num)
# print(number)
# print (min(number))
# print (max(number))
# print (sum(number))
# 6 Задание
# my_list = []
# for i in range(1000):
#     my_list.append(0)
# print(my_list)
# 7 Задание
# change = []
# print(change)
# text1 = input("Введите: ")
# text2 = input("Введите: ") 
# text1,text2 = text2, text1
# print(f"{text1},{text2}")
# Tuple ЗАДАЧА
# movie = ('Маска', 'Пираты карибского', 'Детпул' )
# print(type(movie))
# print(movie)
#2
# movie = ('Маска', 'Пираты карибского', 'Детпул' )
# print(type(movie))
# print(movie[2])
#3
# colors = ('Чорный', 'Красный', "Синий" )
# animals = ('Лошадьи', 'Волки', 'Кошки')
# print(colors+animals)
#4
# animals = ('Лошадь', 'Волк', 'Лев', 'Заец', 'Феникс' )
# print(len(animals))
#5
# num1 = (1,2,3,4,5,6,7,8,9)
# num2 = (1,2,3,4,5,6,7,8,9)
#6
# if num1 == num2:
#     print("Кортежи равны")
# else:
#     print("Кортежи не равны")
#Доп дз
#1
# while True:
#     age = int(input("Введите свой возраст: "))
#     if age >=18:  
#         print("Доступ разрешен")
#         break
#     else:
#         print("Извините, пользование данным ресурсом только с 18 лет.")
#2      
# movie = lit('Маска', 'Пираты карибского', 'Детпул')
# movie.append('Маска') #Ошибка изотого что append  и др не изменяет кортёж
# print(movie) #Можно с помащю List
#3
# user = input("Введите код: ")
# if user == 'po9000000000':
#     name = (('Nurdan','Nurai'),('Nurbolot',"Bakas"),('Islam','Kudbuho'))
#     print(name[0])
#     print(name[1])
#     print(name[2])
# else:
#     print("Error")